zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e4xx.h
/* Bit definition for Ethernet MAC L4 Address3 Register */
#define ETH_MACL3A3R_L3A3_Pos                         (0U)
#define ETH_MACL3A3R_L3A3_Msk                         (0xFFFFFFFFUL << ETH_MACL3A3R_L3A3_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACL3A3R_L3A3                             ETH_MACL3A3R_L3A3_Msk    /* Layer 3 Address 3 Field */

/* Bit definition for Ethernet MAC Indirect Access Control Register   */
#define ETH_MACIACR_MSEL_Pos                          (16U)
#define ETH_MACIACR_MSEL_Msk                          (0xFUL << ETH_MACIACR_MSEL_Pos) /*!< 0x000F0000 */
#define ETH_MACIACR_MSEL                              ETH_MACIACR_MSEL_Msk    /* Mode Select */
#define ETH_MACIACR_MSEL_RXQ                          ((uint32_t)0x00000000)   /* Type-based RXQ mapping */
#define ETH_MACIACR_AOFF_Pos                          (8U)
#define ETH_MACIACR_AOFF_Msk                          (0xFFUL << ETH_MACIACR_AOFF_Pos) /*!< 0x0000FF00 */
#define ETH_MACIACR_AOFF                              ETH_MACIACR_AOFF_Msk    /* Address Offset */
#define ETH_MACIACR_AOFF_IndReg0                      ((uint32_t)0x00000000)   /* Indirect register 0 */
#define ETH_MACIACR_AOFF_IndReg1_Pos                  (8U)
#define ETH_MACIACR_AOFF_IndReg1_Msk                  (0x1UL << ETH_MACIACR_AOFF_IndReg1_Pos) /*!< 0x00000100 */
#define ETH_MACIACR_AOFF_IndReg1                      ETH_MACIACR_AOFF_IndReg1_Msk  /* Indirect register 1 */
#define ETH_MACIACR_AOFF_IndReg2_Pos                  (9U)
#define ETH_MACIACR_AOFF_IndReg2_Msk                  (0x1UL << ETH_MACIACR_AOFF_IndReg2_Pos) /*!< 0x00000200 */
#define ETH_MACIACR_AOFF_IndReg2                      ETH_MACIACR_AOFF_IndReg2_Msk  /* Indirect register 2 */
#define ETH_MACIACR_AOFF_IndReg3_Pos                  (8U)
#define ETH_MACIACR_AOFF_IndReg3_Msk                  (0x3UL << ETH_MACIACR_AOFF_IndReg3_Pos) /*!< 0x00000300 */
#define ETH_MACIACR_AOFF_IndReg3                      ETH_MACIACR_AOFF_IndReg3_Msk  /* Indirect register 3 */
#define ETH_MACIACR_AOFF_IndReg4_Pos                  (10U)
#define ETH_MACIACR_AOFF_IndReg4_Msk                  (0x1UL << ETH_MACIACR_AOFF_IndReg4_Pos) /*!< 0x00000400 */
#define ETH_MACIACR_AOFF_IndReg4                      ETH_MACIACR_AOFF_IndReg4_Msk  /* Indirect register 4 */
#define ETH_MACIACR_AOFF_IndReg5_Pos                  (8U)
#define ETH_MACIACR_AOFF_IndReg5_Msk                  (0x5UL << ETH_MACIACR_AOFF_IndReg5_Pos) /*!< 0x00000500 */
#define ETH_MACIACR_AOFF_IndReg5                      ETH_MACIACR_AOFF_IndReg5_Msk  /* Indirect register 5 */
#define ETH_MACIACR_AOFF_IndReg6_Pos                  (9U)
#define ETH_MACIACR_AOFF_IndReg6_Msk                  (0x3UL << ETH_MACIACR_AOFF_IndReg6_Pos) /*!< 0x00000600 */
#define ETH_MACIACR_AOFF_IndReg6                      ETH_MACIACR_AOFF_IndReg6_Msk  /* Indirect register 6 */
#define ETH_MACIACR_AOFF_IndReg7_Pos                  (8U)
#define ETH_MACIACR_AOFF_IndReg7_Msk                  (0x7UL << ETH_MACIACR_AOFF_IndReg7_Pos) /*!< 0x00000700 */
#define ETH_MACIACR_AOFF_IndReg7                      ETH_MACIACR_AOFF_IndReg7_Msk  /* Indirect register 7 */
#define ETH_MACIACR_AUTO_Pos                          (5U)
#define ETH_MACIACR_AUTO_Msk                          (0x1UL << ETH_MACIACR_AUTO_Pos) /*!< 0x00000020 */
#define ETH_MACIACR_AUTO                              ETH_MACIACR_AUTO_Msk    /* Auto-increment */
#define ETH_MACIACR_COM_Pos                           (1U)
#define ETH_MACIACR_COM_Msk                           (0x1UL << ETH_MACIACR_COM_Pos) /*!< 0x00000002 */
#define ETH_MACIACR_COM                               ETH_MACIACR_COM_Msk    /* Command type: 1: read operation / 0: write operation */
#define ETH_MACIACR_OB_Pos                            (0U)
#define ETH_MACIACR_OB_Msk                            (0x1UL << ETH_MACIACR_OB_Pos) /*!< 0x00000001 */
#define ETH_MACIACR_OB                                ETH_MACIACR_OB_Msk    /* Operation Busy */

/* Bit definition for Ethernet MAC type-based Rx Queue mapping Register   */
#define ETH_MACTMRQR_PFEX_Pos                         (20U)
#define ETH_MACTMRQR_PFEX_Msk                         (0x1UL << ETH_MACTMRQR_PFEX_Pos) /*!< 0x00100000 */
#define ETH_MACTMRQR_PFEX                             ETH_MACTMRQR_PFEX_Msk    /* Preemption or Express Packet */
#define ETH_MACTMRQR_TMRQ_Pos                         (16U)
#define ETH_MACTMRQR_TMRQ_Msk                         (0x7UL << ETH_MACTMRQR_TMRQ_Pos) /*!< 0x00070000 */
#define ETH_MACTMRQR_TMRQ                             ETH_MACTMRQR_TMRQ_Msk    /* Type Match Rx Queue Number */
#define ETH_MACTMRQR_TYP_Pos                          (0U)
#define ETH_MACTMRQR_TYP_Msk                          (0xFFFFUL << ETH_MACTMRQR_TYP_Pos) /*!< 0x0000FFFF */
#define ETH_MACTMRQR_TYP                              ETH_MACTMRQR_TYP_Msk    /* Type field Value */

/* Bit definition for Ethernet MAC Timestamp Control Register */
#define ETH_MACTSCR_AV8021ASMEN_Pos                   (28U)
#define ETH_MACTSCR_AV8021ASMEN_Msk                   (0x1UL << ETH_MACTSCR_AV8021ASMEN_Pos) /*!< 0x10000000 */
#define ETH_MACTSCR_AV8021ASMEN                       ETH_MACTSCR_AV8021ASMEN_Msk  /* AV 802.1AS Mode Enable */
#define ETH_MACTSCR_LITA_Pos                          (27U)
#define ETH_MACTSCR_LITA_Msk                          (0x1UL << ETH_MACTSCR_LITA_Pos) /*!< 0x08000000 */
#define ETH_MACTSCR_LITA                              ETH_MACTSCR_LITA_Msk  /* Latency Input Based Timestamp Accuracy Disable */
#define ETH_MACTSCR_ECPD_Pos                          (26U)
#define ETH_MACTSCR_ECPD_Msk                          (0x1UL << ETH_MACTSCR_ECPD_Pos) /*!< 0x04000000 */
#define ETH_MACTSCR_ECPD                              ETH_MACTSCR_ECPD_Msk  /* Enable Timestamp Capturing in PTP Clock Domain */
#define ETH_MACTSCR_EPCSL_Pos                         (25U)
#define ETH_MACTSCR_EPCSL_Msk                         (0x1UL << ETH_MACTSCR_EPCSL_Pos) /*!< 0x02000000 */
#define ETH_MACTSCR_EPCSL                             ETH_MACTSCR_EPCSL_Msk  /* Enable PCS latencies */
#define ETH_MACTSCR_TXTSSTSM_Pos                      (24U)
#define ETH_MACTSCR_TXTSSTSM_Msk                      (0x1UL << ETH_MACTSCR_TXTSSTSM_Pos) /*!< 0x01000000 */
#define ETH_MACTSCR_TXTSSTSM                          ETH_MACTSCR_TXTSSTSM_Msk  /* Transmit Timestamp Status Mode */
#define ETH_MACTSCR_TSENMACADDR_Pos                   (18U)
#define ETH_MACTSCR_TSENMACADDR_Msk                   (0x1UL << ETH_MACTSCR_TSENMACADDR_Pos) /*!< 0x00040000 */
#define ETH_MACTSCR_TSENMACADDR                       ETH_MACTSCR_TSENMACADDR_Msk  /* Enable MAC Address for PTP Packet Filtering */
#define ETH_MACTSCR_SNAPTYPSEL_Pos                    (16U)
#define ETH_MACTSCR_SNAPTYPSEL_Msk                    (0x3UL << ETH_MACTSCR_SNAPTYPSEL_Pos) /*!< 0x00030000 */
#define ETH_MACTSCR_SNAPTYPSEL                        ETH_MACTSCR_SNAPTYPSEL_Msk  /* Select PTP packets for Taking Snapshots */
#define ETH_MACTSCR_TSMSTRENA_Pos                     (15U)
#define ETH_MACTSCR_TSMSTRENA_Msk                     (0x1UL << ETH_MACTSCR_TSMSTRENA_Pos) /*!< 0x00008000 */
#define ETH_MACTSCR_TSMSTRENA                         ETH_MACTSCR_TSMSTRENA_Msk  /* Enable Snapshot for Messages Relevant to Master */
#define ETH_MACTSCR_TSEVNTENA_Pos                     (14U)
#define ETH_MACTSCR_TSEVNTENA_Msk                     (0x1UL << ETH_MACTSCR_TSEVNTENA_Pos) /*!< 0x00004000 */
#define ETH_MACTSCR_TSEVNTENA                         ETH_MACTSCR_TSEVNTENA_Msk  /* Enable Timestamp Snapshot for Event Messages */
#define ETH_MACTSCR_TSIPV4ENA_Pos                     (13U)
#define ETH_MACTSCR_TSIPV4ENA_Msk                     (0x1UL << ETH_MACTSCR_TSIPV4ENA_Pos) /*!< 0x00002000 */
#define ETH_MACTSCR_TSIPV4ENA                         ETH_MACTSCR_TSIPV4ENA_Msk  /* Enable Processing of PTP Packets Sent over IPv4-UDP */
#define ETH_MACTSCR_TSIPV6ENA_Pos                     (12U)
#define ETH_MACTSCR_TSIPV6ENA_Msk                     (0x1UL << ETH_MACTSCR_TSIPV6ENA_Pos) /*!< 0x00001000 */
#define ETH_MACTSCR_TSIPV6ENA                         ETH_MACTSCR_TSIPV6ENA_Msk  /* Enable Processing of PTP Packets Sent over IPv6-UDP */
#define ETH_MACTSCR_TSIPENA_Pos                       (11U)
#define ETH_MACTSCR_TSIPENA_Msk                       (0x1UL << ETH_MACTSCR_TSIPENA_Pos) /*!< 0x00000800 */
#define ETH_MACTSCR_TSIPENA                           ETH_MACTSCR_TSIPENA_Msk  /* Enable Processing of PTP over Ethernet Packets */
#define ETH_MACTSCR_TSVER2ENA_Pos                     (10U)
#define ETH_MACTSCR_TSVER2ENA_Msk                     (0x1UL << ETH_MACTSCR_TSVER2ENA_Pos) /*!< 0x00000400 */
#define ETH_MACTSCR_TSVER2ENA                         ETH_MACTSCR_TSVER2ENA_Msk  /* Enable PTP Packet Processing for Version 2 Format */
#define ETH_MACTSCR_TSCTRLSSR_Pos                     (9U)
#define ETH_MACTSCR_TSCTRLSSR_Msk                     (0x1UL << ETH_MACTSCR_TSCTRLSSR_Pos) /*!< 0x00000200 */
#define ETH_MACTSCR_TSCTRLSSR                         ETH_MACTSCR_TSCTRLSSR_Msk  /* Timestamp Digital or Binary Rollover Control */
#define ETH_MACTSCR_TSENALL_Pos                       (8U)
#define ETH_MACTSCR_TSENALL_Msk                       (0x1UL << ETH_MACTSCR_TSENALL_Pos) /*!< 0x00000100 */
#define ETH_MACTSCR_TSENALL                           ETH_MACTSCR_TSENALL_Msk  /* Enable Timestamp for All Packets */
#define ETH_MACTSCR_PTGE_Pos                          (6U)
#define ETH_MACTSCR_PTGE_Msk                          (0x1UL << ETH_MACTSCR_PTGE_Pos) /*!< 0x00000040 */
#define ETH_MACTSCR_PTGE                              ETH_MACTSCR_PTGE_Msk  /* Presentation Time Generation Enable */
#define ETH_MACTSCR_TSADDREG_Pos                      (5U)
#define ETH_MACTSCR_TSADDREG_Msk                      (0x1UL << ETH_MACTSCR_TSADDREG_Pos) /*!< 0x00000020 */
#define ETH_MACTSCR_TSADDREG                          ETH_MACTSCR_TSADDREG_Msk  /* Update Addend Register */
#define ETH_MACTSCR_TSUPDT_Pos                        (3U)
#define ETH_MACTSCR_TSUPDT_Msk                        (0x1UL << ETH_MACTSCR_TSUPDT_Pos) /*!< 0x00000008 */
#define ETH_MACTSCR_TSUPDT                            ETH_MACTSCR_TSUPDT_Msk  /* Update Timestamp */
#define ETH_MACTSCR_TSINIT_Pos                        (2U)
#define ETH_MACTSCR_TSINIT_Msk                        (0x1UL << ETH_MACTSCR_TSINIT_Pos) /*!< 0x00000004 */
#define ETH_MACTSCR_TSINIT                             ETH_MACTSCR_TSINIT_Msk  /* Initialize Timestamp */
#define ETH_MACTSCR_TSCFUPDT_Pos                      (1U)
#define ETH_MACTSCR_TSCFUPDT_Msk                      (0x1UL << ETH_MACTSCR_TSCFUPDT_Pos) /*!< 0x00000002 */
#define ETH_MACTSCR_TSCFUPDT                          ETH_MACTSCR_TSCFUPDT_Msk  /* Fine or Coarse Timestamp Update*/
#define ETH_MACTSCR_TSENA_Pos                         (0U)
#define ETH_MACTSCR_TSENA_Msk                         (0x1UL << ETH_MACTSCR_TSENA_Pos) /*!< 0x00000001 */
#define ETH_MACTSCR_TSENA                             ETH_MACTSCR_TSENA_Msk  /* Enable Timestamp */

/* Bit definition for Ethernet MAC Sub-second Increment Register */
#define ETH_MACMACSSIR_SSINC_Pos                      (16U)
#define ETH_MACMACSSIR_SSINC_Msk                      (0xFFUL << ETH_MACMACSSIR_SSINC_Pos) /*!< 0x0000FF00 */
#define ETH_MACMACSSIR_SSINC                          ETH_MACMACSSIR_SSINC_Msk  /* Sub-second Increment Value */

/* Bit definition for Ethernet MAC System Time Seconds Register */
#define ETH_MACSTSR_TSS_Pos                           (0U)
#define ETH_MACSTSR_TSS_Msk                           (0xFFFFFFFFUL << ETH_MACSTSR_TSS_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACSTSR_TSS                               ETH_MACSTSR_TSS_Msk  /* Timestamp Second */

/* Bit definition for Ethernet MAC System Time Nanoseconds Register */
#define ETH_MACSTNR_TSSS_Pos                          (0U)
#define ETH_MACSTNR_TSSS_Msk                          (0x7FFFFFFFUL << ETH_MACSTNR_TSSS_Pos) /*!< 0x7FFFFFFF */
#define ETH_MACSTNR_TSSS                              ETH_MACSTNR_TSSS_Msk  /* Timestamp Sub-seconds */

