zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e4xx.h
#define PLAY_SWIN_SWIN4_Pos             (4U)
#define PLAY_SWIN_SWIN4_Msk             (0x01UL << PLAY_SWIN_SWIN4_Pos)         /*!< 0x00000010 */
#define PLAY_SWIN_SWIN4                 PLAY_SWIN_SWIN4_Msk                     /*!< Input SWIN4 state */

#define PLAY_SWIN_SWIN5_Pos             (5U)
#define PLAY_SWIN_SWIN5_Msk             (0x01UL << PLAY_SWIN_SWIN5_Pos)         /*!< 0x00000020 */
#define PLAY_SWIN_SWIN5                 PLAY_SWIN_SWIN5_Msk                     /*!< Input SWIN5 state */

#define PLAY_SWIN_SWIN6_Pos             (6U)
#define PLAY_SWIN_SWIN6_Msk             (0x01UL << PLAY_SWIN_SWIN6_Pos)         /*!< 0x00000040 */
#define PLAY_SWIN_SWIN6                 PLAY_SWIN_SWIN6_Msk                     /*!< Input SWIN6 state */

#define PLAY_SWIN_SWIN7_Pos             (7U)
#define PLAY_SWIN_SWIN7_Msk             (0x01UL << PLAY_SWIN_SWIN7_Pos)         /*!< 0x00000080 */
#define PLAY_SWIN_SWIN7                 PLAY_SWIN_SWIN7_Msk                     /*!< Input SWIN7 state */

#define PLAY_SWIN_SWIN8_Pos             (8U)
#define PLAY_SWIN_SWIN8_Msk             (0x01UL << PLAY_SWIN_SWIN8_Pos)         /*!< 0x00000100 */
#define PLAY_SWIN_SWIN8                 PLAY_SWIN_SWIN8_Msk                     /*!< Input SWIN8 state */

#define PLAY_SWIN_SWIN9_Pos             (9U)
#define PLAY_SWIN_SWIN9_Msk             (0x01UL << PLAY_SWIN_SWIN9_Pos)         /*!< 0x00000200 */
#define PLAY_SWIN_SWIN9                 PLAY_SWIN_SWIN9_Msk                     /*!< Input SWIN9 state */

#define PLAY_SWIN_SWIN10_Pos            (10U)
#define PLAY_SWIN_SWIN10_Msk            (0x01UL << PLAY_SWIN_SWIN10_Pos)        /*!< 0x00000400 */
#define PLAY_SWIN_SWIN10                PLAY_SWIN_SWIN10_Msk                    /*!< Input SWIN10 state */

#define PLAY_SWIN_SWIN11_Pos            (11U)
#define PLAY_SWIN_SWIN11_Msk            (0x01UL << PLAY_SWIN_SWIN11_Pos)        /*!< 0x00000800 */
#define PLAY_SWIN_SWIN11                PLAY_SWIN_SWIN11_Msk                    /*!< Input SWIN11 state */

#define PLAY_SWIN_SWIN12_Pos            (12U)
#define PLAY_SWIN_SWIN12_Msk            (0x01UL << PLAY_SWIN_SWIN12_Pos)        /*!< 0x00001000 */
#define PLAY_SWIN_SWIN12                PLAY_SWIN_SWIN12_Msk                    /*!< Input SWIN12 state */

#define PLAY_SWIN_SWIN13_Pos            (13U)
#define PLAY_SWIN_SWIN13_Msk            (0x01UL << PLAY_SWIN_SWIN13_Pos)        /*!< 0x00002000 */
#define PLAY_SWIN_SWIN13                PLAY_SWIN_SWIN13_Msk                    /*!< Input SWIN13 state */

#define PLAY_SWIN_SWIN14_Pos            (14U)
#define PLAY_SWIN_SWIN14_Msk            (0x01UL << PLAY_SWIN_SWIN14_Pos)        /*!< 0x00004000 */
#define PLAY_SWIN_SWIN14                PLAY_SWIN_SWIN14_Msk                    /*!< Input SWIN14 state */

#define PLAY_SWIN_SWIN15_Pos            (15U)
#define PLAY_SWIN_SWIN15_Msk            (0x01UL << PLAY_SWIN_SWIN15_Pos)        /*!< 0x00008000 */
#define PLAY_SWIN_SWIN15                PLAY_SWIN_SWIN15_Msk                    /*!< Input SWIN15 state */

/******************  Bit definition for PLAY_SWINSET register  ****************/
#define PLAY_SWINSET_SWIN0_Pos          (0U)
#define PLAY_SWINSET_SWIN0_Msk          (0x01UL << PLAY_SWINSET_SWIN0_Pos)      /*!< 0x00000001 */
#define PLAY_SWINSET_SWIN0              PLAY_SWINSET_SWIN0_Msk                  /*!< Set SWIN0 input */

#define PLAY_SWINSET_SWIN1_Pos          (1U)
#define PLAY_SWINSET_SWIN1_Msk          (0x01UL << PLAY_SWINSET_SWIN1_Pos)      /*!< 0x00000002 */
#define PLAY_SWINSET_SWIN1              PLAY_SWINSET_SWIN1_Msk                  /*!< Set SWIN1 input */

#define PLAY_SWINSET_SWIN2_Pos          (2U)
#define PLAY_SWINSET_SWIN2_Msk          (0x01UL << PLAY_SWINSET_SWIN2_Pos)      /*!< 0x00000004 */
#define PLAY_SWINSET_SWIN2              PLAY_SWINSET_SWIN2_Msk                  /*!< Set SWIN2 input */

#define PLAY_SWINSET_SWIN3_Pos          (3U)
#define PLAY_SWINSET_SWIN3_Msk          (0x01UL << PLAY_SWINSET_SWIN3_Pos)      /*!< 0x00000008 */
#define PLAY_SWINSET_SWIN3              PLAY_SWINSET_SWIN3_Msk                  /*!< Set SWIN3 input */

#define PLAY_SWINSET_SWIN4_Pos          (4U)
#define PLAY_SWINSET_SWIN4_Msk          (0x01UL << PLAY_SWINSET_SWIN4_Pos)      /*!< 0x00000010 */
#define PLAY_SWINSET_SWIN4              PLAY_SWINSET_SWIN4_Msk                  /*!< Set SWIN4 input */

#define PLAY_SWINSET_SWIN5_Pos          (5U)
#define PLAY_SWINSET_SWIN5_Msk          (0x01UL << PLAY_SWINSET_SWIN5_Pos)      /*!< 0x00000020 */
#define PLAY_SWINSET_SWIN5              PLAY_SWINSET_SWIN5_Msk                  /*!< Set SWIN5 input */

#define PLAY_SWINSET_SWIN6_Pos          (6U)
#define PLAY_SWINSET_SWIN6_Msk          (0x01UL << PLAY_SWINSET_SWIN6_Pos)      /*!< 0x00000040 */
#define PLAY_SWINSET_SWIN6              PLAY_SWINSET_SWIN6_Msk                  /*!< Set SWIN6 input */

#define PLAY_SWINSET_SWIN7_Pos          (7U)
#define PLAY_SWINSET_SWIN7_Msk          (0x01UL << PLAY_SWINSET_SWIN7_Pos)      /*!< 0x00000080 */
#define PLAY_SWINSET_SWIN7              PLAY_SWINSET_SWIN7_Msk                  /*!< Set SWIN7 input */

#define PLAY_SWINSET_SWIN8_Pos          (8U)
#define PLAY_SWINSET_SWIN8_Msk          (0x01UL << PLAY_SWINSET_SWIN8_Pos)      /*!< 0x00000100 */
#define PLAY_SWINSET_SWIN8              PLAY_SWINSET_SWIN8_Msk                  /*!< Set SWIN8 input */

#define PLAY_SWINSET_SWIN9_Pos          (9U)
#define PLAY_SWINSET_SWIN9_Msk          (0x01UL << PLAY_SWINSET_SWIN9_Pos)      /*!< 0x00000200 */
#define PLAY_SWINSET_SWIN9              PLAY_SWINSET_SWIN9_Msk                  /*!< Set SWIN9 input */

#define PLAY_SWINSET_SWIN10_Pos         (10U)
#define PLAY_SWINSET_SWIN10_Msk         (0x01UL << PLAY_SWINSET_SWIN10_Pos)     /*!< 0x00000400 */
#define PLAY_SWINSET_SWIN10             PLAY_SWINSET_SWIN10_Msk                 /*!< Set SWIN10 input */

#define PLAY_SWINSET_SWIN11_Pos         (11U)
#define PLAY_SWINSET_SWIN11_Msk         (0x01UL << PLAY_SWINSET_SWIN11_Pos)     /*!< 0x00000800 */
#define PLAY_SWINSET_SWIN11             PLAY_SWINSET_SWIN11_Msk                 /*!< Set SWIN11 input */

#define PLAY_SWINSET_SWIN12_Pos         (12U)
#define PLAY_SWINSET_SWIN12_Msk         (0x01UL << PLAY_SWINSET_SWIN12_Pos)     /*!< 0x00001000 */
#define PLAY_SWINSET_SWIN12             PLAY_SWINSET_SWIN12_Msk                 /*!< Set SWIN12 input */

#define PLAY_SWINSET_SWIN13_Pos         (13U)
#define PLAY_SWINSET_SWIN13_Msk         (0x01UL << PLAY_SWINSET_SWIN13_Pos)     /*!< 0x00002000 */
#define PLAY_SWINSET_SWIN13             PLAY_SWINSET_SWIN13_Msk                 /*!< Set SWIN13 input */

#define PLAY_SWINSET_SWIN14_Pos         (14U)
#define PLAY_SWINSET_SWIN14_Msk         (0x01UL << PLAY_SWINSET_SWIN14_Pos)     /*!< 0x00004000 */
#define PLAY_SWINSET_SWIN14             PLAY_SWINSET_SWIN14_Msk                 /*!< Set SWIN14 input */

