zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e4xx.h
#define PLAY_OSR_LEOUTD11_Pos         (11U)
#define PLAY_OSR_LEOUTD11_Msk         (0x01UL << PLAY_OSR_LEOUTD11_Pos)         /*!< 0x00000800 */
#define PLAY_OSR_LEOUTD11             PLAY_OSR_LEOUTD11_Msk                     /*!< LEOUTD11 output */

#define PLAY_OSR_LEOUTD12_Pos         (12U)
#define PLAY_OSR_LEOUTD12_Msk         (0x01UL << PLAY_OSR_LEOUTD12_Pos)         /*!< 0x00001000 */
#define PLAY_OSR_LEOUTD12             PLAY_OSR_LEOUTD12_Msk                     /*!< LEOUTD12 output */

#define PLAY_OSR_LEOUTD13_Pos         (13U)
#define PLAY_OSR_LEOUTD13_Msk         (0x01UL << PLAY_OSR_LEOUTD13_Pos)         /*!< 0x00002000 */
#define PLAY_OSR_LEOUTD13             PLAY_OSR_LEOUTD13_Msk                     /*!< LEOUTD13 output */

#define PLAY_OSR_LEOUTD14_Pos         (14U)
#define PLAY_OSR_LEOUTD14_Msk         (0x01UL << PLAY_OSR_LEOUTD14_Pos)         /*!< 0x00004000 */
#define PLAY_OSR_LEOUTD14             PLAY_OSR_LEOUTD14_Msk                     /*!< LEOUTD14 output */

#define PLAY_OSR_LEOUTD15_Pos         (15U)
#define PLAY_OSR_LEOUTD15_Msk         (0x01UL << PLAY_OSR_LEOUTD15_Pos)         /*!< 0x00008000 */
#define PLAY_OSR_LEOUTD15             PLAY_OSR_LEOUTD15_Msk                     /*!< LEOUTD15 output */

#define PLAY_OSR_LEOUTR0_Pos          (16U)
#define PLAY_OSR_LEOUTR0_Msk          (0x01UL << PLAY_OSR_LEOUTR0_Pos)          /*!< 0x00010000 */
#define PLAY_OSR_LEOUTR0              PLAY_OSR_LEOUTR0_Msk                      /*!< LEOUTR0 output */

#define PLAY_OSR_LEOUTR1_Pos          (17U)
#define PLAY_OSR_LEOUTR1_Msk          (0x01UL << PLAY_OSR_LEOUTR1_Pos)          /*!< 0x00020000 */
#define PLAY_OSR_LEOUTR1              PLAY_OSR_LEOUTR1_Msk                      /*!< LEOUTR1 output */

#define PLAY_OSR_LEOUTR2_Pos          (18U)
#define PLAY_OSR_LEOUTR2_Msk          (0x01UL << PLAY_OSR_LEOUTR2_Pos)          /*!< 0x00040000 */
#define PLAY_OSR_LEOUTR2              PLAY_OSR_LEOUTR2_Msk                      /*!< LEOUTR2 output */

#define PLAY_OSR_LEOUTR3_Pos          (19U)
#define PLAY_OSR_LEOUTR3_Msk          (0x01UL << PLAY_OSR_LEOUTR3_Pos)          /*!< 0x00080000 */
#define PLAY_OSR_LEOUTR3              PLAY_OSR_LEOUTR3_Msk                      /*!< LEOUTR3 output */

#define PLAY_OSR_LEOUTR4_Pos          (20U)
#define PLAY_OSR_LEOUTR4_Msk          (0x01UL << PLAY_OSR_LEOUTR4_Pos)          /*!< 0x00100000 */
#define PLAY_OSR_LEOUTR4              PLAY_OSR_LEOUTR4_Msk                      /*!< LEOUTR4 output */

#define PLAY_OSR_LEOUTR5_Pos          (21U)
#define PLAY_OSR_LEOUTR5_Msk          (0x01UL << PLAY_OSR_LEOUTR5_Pos)          /*!< 0x00200000 */
#define PLAY_OSR_LEOUTR5              PLAY_OSR_LEOUTR5_Msk                      /*!< LEOUTR5 output */

#define PLAY_OSR_LEOUTR6_Pos          (22U)
#define PLAY_OSR_LEOUTR6_Msk          (0x01UL << PLAY_OSR_LEOUTR6_Pos)          /*!< 0x00400000 */
#define PLAY_OSR_LEOUTR6              PLAY_OSR_LEOUTR6_Msk                      /*!< LEOUTR6 output */

#define PLAY_OSR_LEOUTR7_Pos          (23U)
#define PLAY_OSR_LEOUTR7_Msk          (0x01UL << PLAY_OSR_LEOUTR7_Pos)          /*!< 0x00800000 */
#define PLAY_OSR_LEOUTR7              PLAY_OSR_LEOUTR7_Msk                      /*!< LEOUTR7 output */

#define PLAY_OSR_LEOUTR8_Pos          (24U)
#define PLAY_OSR_LEOUTR8_Msk          (0x01UL << PLAY_OSR_LEOUTR8_Pos)          /*!< 0x01000000 */
#define PLAY_OSR_LEOUTR8              PLAY_OSR_LEOUTR8_Msk                      /*!< LEOUTR8 output */

#define PLAY_OSR_LEOUTR9_Pos          (25U)
#define PLAY_OSR_LEOUTR9_Msk          (0x01UL << PLAY_OSR_LEOUTR9_Pos)          /*!< 0x02000000 */
#define PLAY_OSR_LEOUTR9              PLAY_OSR_LEOUTR9_Msk                      /*!< LEOUTR9 output */

#define PLAY_OSR_LEOUTR10_Pos         (26U)
#define PLAY_OSR_LEOUTR10_Msk         (0x01UL << PLAY_OSR_LEOUTR10_Pos)         /*!< 0x04000000 */
#define PLAY_OSR_LEOUTR10             PLAY_OSR_LEOUTR10_Msk                     /*!< LEOUTR10 output */

#define PLAY_OSR_LEOUTR11_Pos         (27U)
#define PLAY_OSR_LEOUTR11_Msk         (0x01UL << PLAY_OSR_LEOUTR11_Pos)         /*!< 0x08000000 */
#define PLAY_OSR_LEOUTR11             PLAY_OSR_LEOUTR11_Msk                     /*!< LEOUTR11 output */

#define PLAY_OSR_LEOUTR12_Pos         (28U)
#define PLAY_OSR_LEOUTR12_Msk         (0x01UL << PLAY_OSR_LEOUTR12_Pos)         /*!< 0x10000000 */
#define PLAY_OSR_LEOUTR12             PLAY_OSR_LEOUTR12_Msk                     /*!< LEOUTR12 output */

#define PLAY_OSR_LEOUTR13_Pos         (29U)
#define PLAY_OSR_LEOUTR13_Msk         (0x01UL << PLAY_OSR_LEOUTR13_Pos)         /*!< 0x20000000 */
#define PLAY_OSR_LEOUTR13             PLAY_OSR_LEOUTR13_Msk                     /*!< LEOUTR13 output */

#define PLAY_OSR_LEOUTR14_Pos         (30U)
#define PLAY_OSR_LEOUTR14_Msk         (0x01UL << PLAY_OSR_LEOUTR14_Pos)         /*!< 0x40000000 */
#define PLAY_OSR_LEOUTR14             PLAY_OSR_LEOUTR14_Msk                     /*!< LEOUTR14 output */

#define PLAY_OSR_LEOUTR15_Pos         (31U)
#define PLAY_OSR_LEOUTR15_Msk         (0x01UL << PLAY_OSR_LEOUTR15_Pos)         /*!< 0x80000000 */
#define PLAY_OSR_LEOUTR15             PLAY_OSR_LEOUTR15_Msk                     /*!< LEOUTR15 output */

/******************  Bit definition for PLAY_FLSTAT register  *****************/
#define PLAY_FLSTAT_FLAGD0_Pos          (0U)
#define PLAY_FLSTAT_FLAGD0_Msk          (0x01UL << PLAY_FLSTAT_FLAGD0_Pos)      /*!< 0x00000001 */
#define PLAY_FLSTAT_FLAGD0              PLAY_FLSTAT_FLAGD0_Msk                  /*!< Flag Output Direct0 */

#define PLAY_FLSTAT_FLAGD1_Pos          (1U)
#define PLAY_FLSTAT_FLAGD1_Msk          (0x01UL << PLAY_FLSTAT_FLAGD1_Pos)      /*!< 0x00000002 */
#define PLAY_FLSTAT_FLAGD1              PLAY_FLSTAT_FLAGD1_Msk                  /*!< Flag Output Direct1 */

#define PLAY_FLSTAT_FLAGD2_Pos          (2U)
#define PLAY_FLSTAT_FLAGD2_Msk          (0x01UL << PLAY_FLSTAT_FLAGD2_Pos)      /*!< 0x00000004 */
#define PLAY_FLSTAT_FLAGD2              PLAY_FLSTAT_FLAGD2_Msk                  /*!< Flag Output Direct2 */

#define PLAY_FLSTAT_FLAGD3_Pos          (3U)
#define PLAY_FLSTAT_FLAGD3_Msk          (0x01UL << PLAY_FLSTAT_FLAGD3_Pos)      /*!< 0x00000008 */
#define PLAY_FLSTAT_FLAGD3              PLAY_FLSTAT_FLAGD3_Msk                  /*!< Flag Output Direct3 */

#define PLAY_FLSTAT_FLAGD4_Pos          (4U)
#define PLAY_FLSTAT_FLAGD4_Msk          (0x01UL << PLAY_FLSTAT_FLAGD4_Pos)      /*!< 0x00000010 */
#define PLAY_FLSTAT_FLAGD4              PLAY_FLSTAT_FLAGD4_Msk                  /*!< Flag Output Direct4 */

#define PLAY_FLSTAT_FLAGD5_Pos          (5U)
#define PLAY_FLSTAT_FLAGD5_Msk          (0x01UL << PLAY_FLSTAT_FLAGD5_Pos)      /*!< 0x00000020 */
#define PLAY_FLSTAT_FLAGD5              PLAY_FLSTAT_FLAGD5_Msk                  /*!< Flag Output Direct5 */

#define PLAY_FLSTAT_FLAGD6_Pos          (6U)
#define PLAY_FLSTAT_FLAGD6_Msk          (0x01UL << PLAY_FLSTAT_FLAGD6_Pos)      /*!< 0x00000040 */
#define PLAY_FLSTAT_FLAGD6              PLAY_FLSTAT_FLAGD6_Msk                  /*!< Flag Output Direct6 */

#define PLAY_FLSTAT_FLAGD7_Pos          (7U)
#define PLAY_FLSTAT_FLAGD7_Msk          (0x01UL << PLAY_FLSTAT_FLAGD7_Pos)      /*!< 0x00000080 */
#define PLAY_FLSTAT_FLAGD7              PLAY_FLSTAT_FLAGD7_Msk                  /*!< Flag Output Direct7 */

#define PLAY_FLSTAT_FLAGD8_Pos          (8U)
#define PLAY_FLSTAT_FLAGD8_Msk          (0x01UL << PLAY_FLSTAT_FLAGD8_Pos)      /*!< 0x00000100 */
#define PLAY_FLSTAT_FLAGD8              PLAY_FLSTAT_FLAGD8_Msk                  /*!< Flag Output Direct8 */

#define PLAY_FLSTAT_FLAGD9_Pos          (9U)
#define PLAY_FLSTAT_FLAGD9_Msk          (0x01UL << PLAY_FLSTAT_FLAGD9_Pos)      /*!< 0x00000200 */
#define PLAY_FLSTAT_FLAGD9              PLAY_FLSTAT_FLAGD9_Msk                  /*!< Flag Output Direct9 */

#define PLAY_FLSTAT_FLAGD10_Pos         (10U)
#define PLAY_FLSTAT_FLAGD10_Msk         (0x01UL << PLAY_FLSTAT_FLAGD10_Pos)     /*!< 0x00000400 */
#define PLAY_FLSTAT_FLAGD10             PLAY_FLSTAT_FLAGD10_Msk                 /*!< Flag Output Direct10 */

