zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e4xx.h
#define PLAY_FLIER_FLAGR_IEN3_Pos       (19U)
#define PLAY_FLIER_FLAGR_IEN3_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN3_Pos)   /*!< 0x00080000 */
#define PLAY_FLIER_FLAGR_IEN3           PLAY_FLIER_FLAGR_IEN3_Msk               /*!< Flag Interrupt Output Register 3 */

#define PLAY_FLIER_FLAGR_IEN4_Pos       (20U)
#define PLAY_FLIER_FLAGR_IEN4_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN4_Pos)   /*!< 0x00100000 */
#define PLAY_FLIER_FLAGR_IEN4           PLAY_FLIER_FLAGR_IEN4_Msk               /*!< Flag Interrupt Output Register 4 */

#define PLAY_FLIER_FLAGR_IEN5_Pos       (21U)
#define PLAY_FLIER_FLAGR_IEN5_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN5_Pos)   /*!< 0x00200000 */
#define PLAY_FLIER_FLAGR_IEN5           PLAY_FLIER_FLAGR_IEN5_Msk               /*!< Flag Interrupt Output Register 5 */

#define PLAY_FLIER_FLAGR_IEN6_Pos       (22U)
#define PLAY_FLIER_FLAGR_IEN6_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN6_Pos)   /*!< 0x00400000 */
#define PLAY_FLIER_FLAGR_IEN6           PLAY_FLIER_FLAGR_IEN6_Msk               /*!< Flag Interrupt Output Register 6 */

#define PLAY_FLIER_FLAGR_IEN7_Pos       (23U)
#define PLAY_FLIER_FLAGR_IEN7_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN7_Pos)   /*!< 0x00800000 */
#define PLAY_FLIER_FLAGR_IEN7           PLAY_FLIER_FLAGR_IEN7_Msk               /*!< Flag Interrupt Output Register 7 */

#define PLAY_FLIER_FLAGR_IEN8_Pos       (24U)
#define PLAY_FLIER_FLAGR_IEN8_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN8_Pos)   /*!< 0x01000000 */
#define PLAY_FLIER_FLAGR_IEN8           PLAY_FLIER_FLAGR_IEN8_Msk               /*!< Flag Interrupt Output Register 8 */

#define PLAY_FLIER_FLAGR_IEN9_Pos       (25U)
#define PLAY_FLIER_FLAGR_IEN9_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN9_Pos)   /*!< 0x02000000 */
#define PLAY_FLIER_FLAGR_IEN9           PLAY_FLIER_FLAGR_IEN9_Msk               /*!< Flag Interrupt Output Register 9 */

#define PLAY_FLIER_FLAGR_IEN10_Pos      (26U)
#define PLAY_FLIER_FLAGR_IEN10_Msk      (0x01UL << PLAY_FLIER_FLAGR_IEN10_Pos)  /*!< 0x04000000 */
#define PLAY_FLIER_FLAGR_IEN10          PLAY_FLIER_FLAGR_IEN10_Msk              /*!< Flag Interrupt Output Register 10 */

#define PLAY_FLIER_FLAGR_IEN11_Pos      (27U)
#define PLAY_FLIER_FLAGR_IEN11_Msk      (0x01UL << PLAY_FLIER_FLAGR_IEN11_Pos)  /*!< 0x08000000 */
#define PLAY_FLIER_FLAGR_IEN11          PLAY_FLIER_FLAGR_IEN11_Msk              /*!< Flag Interrupt Output Register 11 */

#define PLAY_FLIER_FLAGR_IEN12_Pos      (28U)
#define PLAY_FLIER_FLAGR_IEN12_Msk      (0x01UL << PLAY_FLIER_FLAGR_IEN12_Pos)  /*!< 0x10000000 */
#define PLAY_FLIER_FLAGR_IEN12          PLAY_FLIER_FLAGR_IEN12_Msk              /*!< Flag Interrupt Output Register 12 */

#define PLAY_FLIER_FLAGR_IEN13_Pos      (29U)
#define PLAY_FLIER_FLAGR_IEN13_Msk      (0x01UL << PLAY_FLIER_FLAGR_IEN13_Pos)  /*!< 0x20000000 */
#define PLAY_FLIER_FLAGR_IEN13          PLAY_FLIER_FLAGR_IEN13_Msk              /*!< Flag Interrupt Output Register 13 */

#define PLAY_FLIER_FLAGR_IEN14_Pos      (30U)
#define PLAY_FLIER_FLAGR_IEN14_Msk      (0x01UL << PLAY_FLIER_FLAGR_IEN14_Pos)  /*!< 0x40000000 */
#define PLAY_FLIER_FLAGR_IEN14          PLAY_FLIER_FLAGR_IEN14_Msk              /*!< Flag Interrupt Output Register 14 */

#define PLAY_FLIER_FLAGR_IEN15_Pos      (31U)
#define PLAY_FLIER_FLAGR_IEN15_Msk      (0x01UL << PLAY_FLIER_FLAGR_IEN15_Pos)  /*!< 0x80000000 */
#define PLAY_FLIER_FLAGR_IEN15          PLAY_FLIER_FLAGR_IEN15_Msk              /*!< Flag Interrupt Output Register 15 */

/******************  Bit definition for PLAY_FLCTL register  ******************/
#define PLAY_FLCTL_FLAGD_EDGE0_Pos     (0U)
#define PLAY_FLCTL_FLAGD_EDGE0_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE0_Pos)   /*!< 0x00000001 */
#define PLAY_FLCTL_FLAGD_EDGE0         PLAY_FLCTL_FLAGD_EDGE0_Msk               /*!< Edge Direction for Output Direct0 */

#define PLAY_FLCTL_FLAGD_EDGE1_Pos     (1U)
#define PLAY_FLCTL_FLAGD_EDGE1_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE1_Pos)   /*!< 0x00000002 */
#define PLAY_FLCTL_FLAGD_EDGE1         PLAY_FLCTL_FLAGD_EDGE1_Msk               /*!< Edge Direction for Output Direct1 */

#define PLAY_FLCTL_FLAGD_EDGE2_Pos     (2U)
#define PLAY_FLCTL_FLAGD_EDGE2_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE2_Pos)   /*!< 0x00000004 */
#define PLAY_FLCTL_FLAGD_EDGE2         PLAY_FLCTL_FLAGD_EDGE2_Msk               /*!< Edge Direction for Output Direct2 */

#define PLAY_FLCTL_FLAGD_EDGE3_Pos     (3U)
#define PLAY_FLCTL_FLAGD_EDGE3_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE3_Pos)   /*!< 0x00000008 */
#define PLAY_FLCTL_FLAGD_EDGE3         PLAY_FLCTL_FLAGD_EDGE3_Msk               /*!< Edge Direction for Output Direct3 */

#define PLAY_FLCTL_FLAGD_EDGE4_Pos     (4U)
#define PLAY_FLCTL_FLAGD_EDGE4_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE4_Pos)   /*!< 0x00000010 */
#define PLAY_FLCTL_FLAGD_EDGE4         PLAY_FLCTL_FLAGD_EDGE4_Msk               /*!< Edge Direction for Output Direct4 */

#define PLAY_FLCTL_FLAGD_EDGE5_Pos     (5U)
#define PLAY_FLCTL_FLAGD_EDGE5_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE5_Pos)   /*!< 0x00000020 */
#define PLAY_FLCTL_FLAGD_EDGE5         PLAY_FLCTL_FLAGD_EDGE5_Msk               /*!< Edge Direction for Output Direct5 */

#define PLAY_FLCTL_FLAGD_EDGE6_Pos     (6U)
#define PLAY_FLCTL_FLAGD_EDGE6_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE6_Pos)   /*!< 0x00000040 */
#define PLAY_FLCTL_FLAGD_EDGE6         PLAY_FLCTL_FLAGD_EDGE6_Msk               /*!< Edge Direction for Output Direct6 */

#define PLAY_FLCTL_FLAGD_EDGE7_Pos     (7U)
#define PLAY_FLCTL_FLAGD_EDGE7_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE7_Pos)   /*!< 0x00000080 */
#define PLAY_FLCTL_FLAGD_EDGE7         PLAY_FLCTL_FLAGD_EDGE7_Msk               /*!< Edge Direction for Output Direct7 */

#define PLAY_FLCTL_FLAGD_EDGE8_Pos     (8U)
#define PLAY_FLCTL_FLAGD_EDGE8_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE8_Pos)   /*!< 0x00000100 */
#define PLAY_FLCTL_FLAGD_EDGE8         PLAY_FLCTL_FLAGD_EDGE8_Msk               /*!< Edge Direction for Output Direct8 */

#define PLAY_FLCTL_FLAGD_EDGE9_Pos     (9U)
#define PLAY_FLCTL_FLAGD_EDGE9_Msk     (0x01UL << PLAY_FLCTL_FLAGD_EDGE9_Pos)   /*!< 0x00000200 */
#define PLAY_FLCTL_FLAGD_EDGE9         PLAY_FLCTL_FLAGD_EDGE9_Msk               /*!< Edge Direction for Output Direct9 */

#define PLAY_FLCTL_FLAGD_EDGE10_Pos    (10U)
#define PLAY_FLCTL_FLAGD_EDGE10_Msk    (0x01UL << PLAY_FLCTL_FLAGD_EDGE10_Pos)  /*!< 0x00000400 */
#define PLAY_FLCTL_FLAGD_EDGE10        PLAY_FLCTL_FLAGD_EDGE10_Msk              /*!< Edge Direction for Output Direct10 */

#define PLAY_FLCTL_FLAGD_EDGE11_Pos    (11U)
#define PLAY_FLCTL_FLAGD_EDGE11_Msk    (0x01UL << PLAY_FLCTL_FLAGD_EDGE11_Pos)  /*!< 0x00000800 */
#define PLAY_FLCTL_FLAGD_EDGE11        PLAY_FLCTL_FLAGD_EDGE11_Msk              /*!< Edge Direction for Output Direct11 */

