zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e4xx.h
/******************  Bit definition for RAMCFG_WPR3 register  ****************/
#define RAMCFG_WPR3_P64WP_Pos               (0U)
#define RAMCFG_WPR3_P64WP_Msk               (0x1UL << RAMCFG_WPR3_P64WP_Pos)        /*!< 0x00000001 */
#define RAMCFG_WPR3_P64WP                   RAMCFG_WPR3_P64WP_Msk                   /*!< Write Protection Page 64 */
#define RAMCFG_WPR3_P65WP_Pos               (1U)
#define RAMCFG_WPR3_P65WP_Msk               (0x1UL << RAMCFG_WPR3_P65WP_Pos)        /*!< 0x00000002 */
#define RAMCFG_WPR3_P65WP                   RAMCFG_WPR3_P65WP_Msk                   /*!< Write Protection Page 65 */
#define RAMCFG_WPR3_P66WP_Pos               (2U)
#define RAMCFG_WPR3_P66WP_Msk               (0x1UL << RAMCFG_WPR3_P66WP_Pos)        /*!< 0x00000004 */
#define RAMCFG_WPR3_P66WP                   RAMCFG_WPR3_P66WP_Msk                   /*!< Write Protection Page 66 */
#define RAMCFG_WPR3_P67WP_Pos               (3U)
#define RAMCFG_WPR3_P67WP_Msk               (0x1UL << RAMCFG_WPR3_P67WP_Pos)        /*!< 0x00000008 */
#define RAMCFG_WPR3_P67WP                   RAMCFG_WPR3_P67WP_Msk                   /*!< Write Protection Page 67 */
#define RAMCFG_WPR3_P68WP_Pos               (4U)
#define RAMCFG_WPR3_P68WP_Msk               (0x1UL << RAMCFG_WPR3_P68WP_Pos)        /*!< 0x00000010 */
#define RAMCFG_WPR3_P68WP                   RAMCFG_WPR3_P68WP_Msk                   /*!< Write Protection Page 68 */
#define RAMCFG_WPR3_P69WP_Pos               (5U)
#define RAMCFG_WPR3_P69WP_Msk               (0x1UL << RAMCFG_WPR3_P69WP_Pos)        /*!< 0x00000020 */
#define RAMCFG_WPR3_P69WP                   RAMCFG_WPR3_P69WP_Msk                   /*!< Write Protection Page 69 */
#define RAMCFG_WPR3_P70WP_Pos               (6U)
#define RAMCFG_WPR3_P70WP_Msk               (0x1UL << RAMCFG_WPR3_P70WP_Pos)        /*!< 0x00000040 */
#define RAMCFG_WPR3_P70WP                   RAMCFG_WPR3_P70WP_Msk                   /*!< Write Protection Page 70 */
#define RAMCFG_WPR3_P71WP_Pos               (7U)
#define RAMCFG_WPR3_P71WP_Msk               (0x1UL << RAMCFG_WPR3_P71WP_Pos)        /*!< 0x00000080 */
#define RAMCFG_WPR3_P71WP                   RAMCFG_WPR3_P71WP_Msk                   /*!< Write Protection Page 71 */
#define RAMCFG_WPR3_P72WP_Pos               (8U)
#define RAMCFG_WPR3_P72WP_Msk               (0x1UL << RAMCFG_WPR3_P72WP_Pos)        /*!< 0x00000100 */
#define RAMCFG_WPR3_P72WP                   RAMCFG_WPR3_P72WP_Msk                   /*!< Write Protection Page 72 */
#define RAMCFG_WPR3_P73WP_Pos               (9U)
#define RAMCFG_WPR3_P73WP_Msk               (0x1UL << RAMCFG_WPR3_P73WP_Pos)        /*!< 0x00000200 */
#define RAMCFG_WPR3_P73WP                   RAMCFG_WPR3_P73WP_Msk                   /*!< Write Protection Page 73 */
#define RAMCFG_WPR3_P74WP_Pos               (10U)
#define RAMCFG_WPR3_P74WP_Msk               (0x1UL << RAMCFG_WPR3_P74WP_Pos)        /*!< 0x00000400 */
#define RAMCFG_WPR3_P74WP                   RAMCFG_WPR3_P74WP_Msk                   /*!< Write Protection Page 74 */
#define RAMCFG_WPR3_P75WP_Pos               (11U)
#define RAMCFG_WPR3_P75WP_Msk               (0x1UL << RAMCFG_WPR3_P75WP_Pos)        /*!< 0x00000800 */
#define RAMCFG_WPR3_P75WP                   RAMCFG_WPR3_P75WP_Msk                   /*!< Write Protection Page 75 */
#define RAMCFG_WPR3_P76WP_Pos               (12U)
#define RAMCFG_WPR3_P76WP_Msk               (0x1UL << RAMCFG_WPR3_P76WP_Pos)        /*!< 0x00001000 */
#define RAMCFG_WPR3_P76WP                   RAMCFG_WPR3_P76WP_Msk                   /*!< Write Protection Page 76 */
#define RAMCFG_WPR3_P77WP_Pos               (13U)
#define RAMCFG_WPR3_P77WP_Msk               (0x1UL << RAMCFG_WPR3_P77WP_Pos)        /*!< 0x00002000 */
#define RAMCFG_WPR3_P77WP                   RAMCFG_WPR3_P77WP_Msk                   /*!< Write Protection Page 77 */
#define RAMCFG_WPR3_P78WP_Pos               (14U)
#define RAMCFG_WPR3_P78WP_Msk               (0x1UL << RAMCFG_WPR3_P78WP_Pos)        /*!< 0x00004000 */
#define RAMCFG_WPR3_P78WP                   RAMCFG_WPR3_P78WP_Msk                   /*!< Write Protection Page 78 */
#define RAMCFG_WPR3_P79WP_Pos               (15U)
#define RAMCFG_WPR3_P79WP_Msk               (0x1UL << RAMCFG_WPR3_P79WP_Pos)        /*!< 0x00008000 */
#define RAMCFG_WPR3_P79WP                   RAMCFG_WPR3_P79WP_Msk                   /*!< Write Protection Page 79 */
#define RAMCFG_WPR3_P80WP_Pos               (16U)
#define RAMCFG_WPR3_P80WP_Msk               (0x1UL << RAMCFG_WPR3_P80WP_Pos)        /*!< 0x00010000 */
#define RAMCFG_WPR3_P80WP                   RAMCFG_WPR3_P80WP_Msk                   /*!< Write Protection Page 80 */
#define RAMCFG_WPR3_P81WP_Pos               (17U)
#define RAMCFG_WPR3_P81WP_Msk               (0x1UL << RAMCFG_WPR3_P81WP_Pos)        /*!< 0x00020000 */
#define RAMCFG_WPR3_P81WP                   RAMCFG_WPR3_P81WP_Msk                   /*!< Write Protection Page 81 */
#define RAMCFG_WPR3_P82WP_Pos               (18U)
#define RAMCFG_WPR3_P82WP_Msk               (0x1UL << RAMCFG_WPR3_P82WP_Pos)        /*!< 0x00040000 */
#define RAMCFG_WPR3_P82WP                   RAMCFG_WPR2_P82WP_Msk                   /*!< Write Protection Page 82 */
#define RAMCFG_WPR3_P83WP_Pos               (19U)
#define RAMCFG_WPR3_P83WP_Msk               (0x1UL << RAMCFG_WPR3_P83WP_Pos)        /*!< 0x00080000 */
#define RAMCFG_WPR3_P83WP                   RAMCFG_WPR3_P83WP_Msk                   /*!< Write Protection Page 83 */
#define RAMCFG_WPR3_P84WP_Pos               (20U)
#define RAMCFG_WPR3_P84WP_Msk               (0x1UL << RAMCFG_WPR3_P84WP_Pos)        /*!< 0x00100000 */
#define RAMCFG_WPR3_P84WP                   RAMCFG_WPR3_P84WP_Msk                   /*!< Write Protection Page 84 */
#define RAMCFG_WPR3_P85WP_Pos               (21U)
#define RAMCFG_WPR3_P85WP_Msk               (0x1UL << RAMCFG_WPR3_P85WP_Pos)        /*!< 0x00200000 */
#define RAMCFG_WPR3_P85WP                   RAMCFG_WPR3_P85WP_Msk                   /*!< Write Protection Page 85 */
#define RAMCFG_WPR3_P86WP_Pos               (22U)
#define RAMCFG_WPR3_P86WP_Msk               (0x1UL << RAMCFG_WPR3_P86WP_Pos)        /*!< 0x00400000 */
#define RAMCFG_WPR3_P86WP                   RAMCFG_WPR3_P86WP_Msk                   /*!< Write Protection Page 86 */
#define RAMCFG_WPR3_P87WP_Pos               (23U)
#define RAMCFG_WPR3_P87WP_Msk               (0x1UL << RAMCFG_WPR3_P87WP_Pos)        /*!< 0x00800000 */
#define RAMCFG_WPR3_P87WP                   RAMCFG_WPR3_P87WP_Msk                   /*!< Write Protection Page 87 */
#define RAMCFG_WPR3_P88WP_Pos               (25U)
#define RAMCFG_WPR3_P88WP_Msk               (0x1UL << RAMCFG_WPR3_P88WP_Pos)        /*!< 0x01000000 */
#define RAMCFG_WPR3_P88WP                   RAMCFG_WPR3_P88WP_Msk                   /*!< Write Protection Page 88 */
#define RAMCFG_WPR3_P89WP_Pos               (26U)
#define RAMCFG_WPR3_P89WP_Msk               (0x1UL << RAMCFG_WPR3_P89WP_Pos)        /*!< 0x02000000 */
#define RAMCFG_WPR3_P89WP                   RAMCFG_WPR3_P89WP_Msk                   /*!< Write Protection Page 89 */
#define RAMCFG_WPR3_P90WP_Pos               (27U)
#define RAMCFG_WPR3_P90WP_Msk               (0x1UL << RAMCFG_WPR3_P90WP_Pos)        /*!< 0x04000000 */
#define RAMCFG_WPR3_P90WP                   RAMCFG_WPR3_P90WP_Msk                   /*!< Write Protection Page 90 */
#define RAMCFG_WPR3_P91WP_Pos               (28U)
#define RAMCFG_WPR3_P91WP_Msk               (0x1UL << RAMCFG_WPR3_P91WP_Pos)        /*!< 0x08000000 */
#define RAMCFG_WPR3_P91WP                   RAMCFG_WPR3_P91WP_Msk                   /*!< Write Protection Page 91 */
#define RAMCFG_WPR3_P92WP_Pos               (29U)
#define RAMCFG_WPR3_P92WP_Msk               (0x1UL << RAMCFG_WPR3_P92WP_Pos)        /*!< 0x10000000 */
#define RAMCFG_WPR3_P92WP                   RAMCFG_WPR3_P92WP_Msk                   /*!< Write Protection Page 92 */
#define RAMCFG_WPR3_P93WP_Pos               (30U)
#define RAMCFG_WPR3_P93WP_Msk               (0x1UL << RAMCFG_WPR3_P93WP_Pos)        /*!< 0x20000000 */
#define RAMCFG_WPR3_P93WP                   RAMCFG_WPR3_P93WP_Msk                   /*!< Write Protection Page 93 */
#define RAMCFG_WPR3_P94WP_Pos               (31U)
#define RAMCFG_WPR3_P94WP_Msk               (0x1UL << RAMCFG_WPR3_P94WP_Pos)        /*!< 0x40000000 */
#define RAMCFG_WPR3_P94WP                   RAMCFG_WPR3_P94WP_Msk                   /*!< Write Protection Page 94 */
#define RAMCFG_WPR3_P95WP_Pos               (31U)
#define RAMCFG_WPR3_P95WP_Msk               (0x1UL << RAMCFG_WPR3_P95WP_Pos)        /*!< 0x80000000 */
#define RAMCFG_WPR3_P95WP                   RAMCFG_WPR3_P95WP_Msk                   /*!< Write Protection Page 95 */
/*****************  Bit definition for RAMCFG_ECCKEYR register  ***************/
#define RAMCFG_ECCKEYR_ECCKEY_Pos           (0U)
#define RAMCFG_ECCKEYR_ECCKEY_Msk           (0xFFUL << RAMCFG_ECCKEYR_ECCKEY_Pos)   /*!< 0x000000FF */
#define RAMCFG_ECCKEYR_ECCKEY               RAMCFG_ECCKEYR_ECCKEY_Msk               /*!< ECC Write Protection Key */

/*****************  Bit definition for RAMCFG_ERKEYR register  ****************/
#define RAMCFG_ERKEYR_ERASEKEY_Pos          (0U)
#define RAMCFG_ERKEYR_ERASEKEY_Msk          (0xFFUL << RAMCFG_ERKEYR_ERASEKEY_Pos)  /*!< 0x000000FF */
#define RAMCFG_ERKEYR_ERASEKEY              RAMCFG_ERKEYR_ERASEKEY_Msk              /*!< Erase Write Protection Key */
/******************  Bit definition for RAMCFG_WPR4 register  ****************/
#define RAMCFG_WPR4_P96WP_Pos               (0U)
#define RAMCFG_WPR4_P96WP_Msk               (0x1UL << RAMCFG_WPR4_P96WP_Pos)         /*!< 0x00000001 */
#define RAMCFG_WPR4_P96WP                   RAMCFG_WPR4_P96WP_Msk                    /*!< Write Protection Page 96 */
#define RAMCFG_WPR4_P97WP_Pos               (1U)
#define RAMCFG_WPR4_P97WP_Msk               (0x1UL << RAMCFG_WPR4_P97WP_Pos)         /*!< 0x00000002 */
#define RAMCFG_WPR4_P97WP                   RAMCFG_WPR4_P97WP_Msk                    /*!< Write Protection Page 97 */
#define RAMCFG_WPR4_P98WP_Pos               (2U)
#define RAMCFG_WPR4_P98WP_Msk               (0x1UL << RAMCFG_WPR4_P98WP_Pos)         /*!< 0x00000004 */
#define RAMCFG_WPR4_P98WP                   RAMCFG_WPR4_P98WP_Msk                    /*!< Write Protection Page 98 */
#define RAMCFG_WPR4_P99WP_Pos               (3U)
#define RAMCFG_WPR4_P99WP_Msk               (0x1UL << RAMCFG_WPR4_P99WP_Pos)         /*!< 0x00000008 */
#define RAMCFG_WPR4_P99WP                   RAMCFG_WPR4_P99WP_Msk                    /*!< Write Protection Page 99 */
#define RAMCFG_WPR4_P100WP_Pos              (4U)
#define RAMCFG_WPR4_P100WP_Msk              (0x1UL << RAMCFG_WPR4_P100WP_Pos)        /*!< 0x00000010 */
#define RAMCFG_WPR4_P100WP                  RAMCFG_WPR4_P100WP_Msk                   /*!< Write Protection Page 100 */
#define RAMCFG_WPR4_P101WP_Pos              (5U)
#define RAMCFG_WPR4_P101WP_Msk              (0x1UL << RAMCFG_WPR4_P101WP_Pos)        /*!< 0x00000020 */
#define RAMCFG_WPR4_P101WP                  RAMCFG_WPR4_P101WP_Msk                   /*!< Write Protection Page 101 */
#define RAMCFG_WPR4_P102WP_Pos              (6U)
#define RAMCFG_WPR4_P102WP_Msk              (0x1UL << RAMCFG_WPR4_P102WP_Pos)        /*!< 0x00000040 */
#define RAMCFG_WPR4_P102WP                  RAMCFG_WPR4_P102WP_Msk                   /*!< Write Protection Page 102 */
#define RAMCFG_WPR4_P103WP_Pos              (7U)
#define RAMCFG_WPR4_P103WP_Msk              (0x1UL << RAMCFG_WPR4_P103WP_Pos)        /*!< 0x00000080 */
#define RAMCFG_WPR4_P103WP                  RAMCFG_WPR4_P103WP_Msk                   /*!< Write Protection Page 103 */
#define RAMCFG_WPR4_P104WP_Pos              (8U)
#define RAMCFG_WPR4_P104WP_Msk              (0x1UL << RAMCFG_WPR4_P104WP_Pos)        /*!< 0x00000100 */
#define RAMCFG_WPR4_P104WP                  RAMCFG_WPR4_P104WP_Msk                   /*!< Write Protection Page 104 */
#define RAMCFG_WPR4_P105WP_Pos              (9U)
#define RAMCFG_WPR4_P105WP_Msk              (0x1UL << RAMCFG_WPR4_P105WP_Pos)        /*!< 0x00000200 */
#define RAMCFG_WPR4_P105WP                  RAMCFG_WPR4_P105WP_Msk                   /*!< Write Protection Page 105 */
#define RAMCFG_WPR4_P106WP_Pos              (10U)
#define RAMCFG_WPR4_P106WP_Msk              (0x1UL << RAMCFG_WPR4_P106WP_Pos)        /*!< 0x00000400 */
#define RAMCFG_WPR4_P106WP                  RAMCFG_WPR4_P106WP_Msk                   /*!< Write Protection Page 106 */
#define RAMCFG_WPR4_P107WP_Pos              (11U)
#define RAMCFG_WPR4_P107WP_Msk              (0x1UL << RAMCFG_WPR4_P107WP_Pos)        /*!< 0x00000800 */
#define RAMCFG_WPR4_P107WP                  RAMCFG_WPR4_P107WP_Msk                   /*!< Write Protection Page 107 */
#define RAMCFG_WPR4_P108WP_Pos              (12U)
#define RAMCFG_WPR4_P108WP_Msk              (0x1UL << RAMCFG_WPR4_P108WP_Pos)        /*!< 0x00001000 */
#define RAMCFG_WPR4_P108WP                  RAMCFG_WPR4_P108WP_Msk                   /*!< Write Protection Page 108 */
#define RAMCFG_WPR4_P109WP_Pos              (13U)
#define RAMCFG_WPR4_P109WP_Msk              (0x1UL << RAMCFG_WPR4_P109WP_Pos)        /*!< 0x00002000 */
#define RAMCFG_WPR4_P109WP                  RAMCFG_WPR4_P109WP_Msk                   /*!< Write Protection Page 109 */
#define RAMCFG_WPR4_P110WP_Pos              (14U)
#define RAMCFG_WPR4_P110WP_Msk              (0x1UL << RAMCFG_WPR4_P110WP_Pos)        /*!< 0x00004000 */
#define RAMCFG_WPR4_P110WP                  RAMCFG_WPR4_P110WP_Msk                   /*!< Write Protection Page 110 */
#define RAMCFG_WPR4_P111WP_Pos              (15U)
#define RAMCFG_WPR4_P111WP_Msk              (0x1UL << RAMCFG_WPR4_P111P_Pos)         /*!< 0x00008000 */
#define RAMCFG_WPR4_P111WP                  RAMCFG_WPR4_P111WP_Msk                   /*!< Write Protection Page 111 */
#define RAMCFG_WPR4_P112WP_Pos              (16U)
#define RAMCFG_WPR4_P112WP_Msk              (0x1UL << RAMCFG_WPR4_P112WP_Pos)        /*!< 0x00010000 */
#define RAMCFG_WPR4_P112WP                  RAMCFG_WPR4_P112WP_Msk                   /*!< Write Protection Page 112 */
#define RAMCFG_WPR4_P113WP_Pos              (17U)
#define RAMCFG_WPR4_P113WP_Msk              (0x1UL << RAMCFG_WPR4_P113WP_Pos)        /*!< 0x00020000 */
#define RAMCFG_WPR4_P113WP                  RAMCFG_WPR4_P113WP_Msk                   /*!< Write Protection Page 113 */
#define RAMCFG_WPR4_P114WP_Pos              (18U)
#define RAMCFG_WPR4_P114WP_Msk              (0x1UL << RAMCFG_WPR4_P114WP_Pos)        /*!< 0x00040000 */
#define RAMCFG_WPR4_P114WP                  RAMCFG_WPR4_P114WP_Msk                   /*!< Write Protection Page 114 */
#define RAMCFG_WPR4_P115WP_Pos              (19U)
#define RAMCFG_WPR4_P115WP_Msk              (0x1UL << RAMCFG_WPR4_P115WP_Pos)        /*!< 0x00080000 */
#define RAMCFG_WPR4_P115WP                  RAMCFG_WPR4_P115WP_Msk                   /*!< Write Protection Page 115 */
#define RAMCFG_WPR4_P116WP_Pos              (20U)
#define RAMCFG_WPR4_P116WP_Msk              (0x1UL << RAMCFG_WPR4_P116WP_Pos)        /*!< 0x00100000 */
#define RAMCFG_WPR4_P116WP                  RAMCFG_WPR4_P116WP_Msk                   /*!< Write Protection Page 116 */
#define RAMCFG_WPR4_P117WP_Pos              (21U)
#define RAMCFG_WPR4_P117WP_Msk              (0x1UL << RAMCFG_WPR4_P117WP_Pos)        /*!< 0x00200000 */
#define RAMCFG_WPR4_P117WP                  RAMCFG_WPR4_P117WP_Msk                   /*!< Write Protection Page 117 */
#define RAMCFG_WPR4_P118WP_Pos              (22U)
#define RAMCFG_WPR4_P118WP_Msk              (0x1UL << RAMCFG_WPR4_P118WP_Pos)        /*!< 0x00400000 */
#define RAMCFG_WPR4_P118WP                  RAMCFG_WPR4_P118WP_Msk                   /*!< Write Protection Page 118 */
#define RAMCFG_WPR4_P119WP_Pos              (23U)
#define RAMCFG_WPR4_P119WP_Msk              (0x1UL << RAMCFG_WPR4_P119WP_Pos)        /*!< 0x00800000 */
#define RAMCFG_WPR4_P119WP                  RAMCFG_WPR4_P119WP_Msk                   /*!< Write Protection Page 119 */
#define RAMCFG_WPR4_P120WP_Pos              (24U)
#define RAMCFG_WPR4_P120WP_Msk              (0x1UL << RAMCFG_WPR4_P120WP_Pos)        /*!< 0x01000000 */
#define RAMCFG_WPR4_P120WP                  RAMCFG_WPR4_P120WP_Msk                   /*!< Write Protection Page 120 */
#define RAMCFG_WPR4_P121WP_Pos              (25U)
#define RAMCFG_WPR4_P121WP_Msk              (0x1UL << RAMCFG_WPR4_P121WP_Pos)        /*!< 0x02000000 */
#define RAMCFG_WPR4_P121WP                  RAMCFG_WPR4_P121WP_Msk                   /*!< Write Protection Page 121 */
#define RAMCFG_WPR4_P122WP_Pos              (26U)
#define RAMCFG_WPR4_P122WP_Msk              (0x1UL << RAMCFG_WPR4_P122WP_Pos)        /*!< 0x04000000 */
#define RAMCFG_WPR4_P122WP                  RAMCFG_WPR4_P122WP_Msk                   /*!< Write Protection Page 122 */
#define RAMCFG_WPR4_P123WP_Pos              (27U)
#define RAMCFG_WPR4_P123WP_Msk              (0x1UL << RAMCFG_WPR4_P123WP_Pos)        /*!< 0x08000000 */
#define RAMCFG_WPR4_P123WP                  RAMCFG_WPR4_P123WP_Msk                   /*!< Write Protection Page 123 */
#define RAMCFG_WPR4_P124WP_Pos              (28U)
#define RAMCFG_WPR4_P124WP_Msk              (0x1UL << RAMCFG_WPR4_P124WP_Pos)        /*!< 0x10000000 */
#define RAMCFG_WPR4_P124WP                  RAMCFG_WPR4_P124WP_Msk                   /*!< Write Protection Page 124 */
#define RAMCFG_WPR4_P125WP_Pos              (29U)
#define RAMCFG_WPR4_P125WP_Msk              (0x1UL << RAMCFG_WPR4_P125WP_Pos)        /*!< 0x20000000 */
#define RAMCFG_WPR4_P125WP                  RAMCFG_WPR4_P125WP_Msk                   /*!< Write Protection Page 125 */
#define RAMCFG_WPR4_P126WP_Pos              (30U)
#define RAMCFG_WPR4_P126WP_Msk              (0x1UL << RAMCFG_WPR4_P126WP_Pos)        /*!< 0x40000000 */
#define RAMCFG_WPR4_P126WP                  RAMCFG_WPR4_P126WP_Msk                   /*!< Write Protection Page 126 */
#define RAMCFG_WPR4_P127WP_Pos              (31U)
#define RAMCFG_WPR4_P127WP_Msk              (0x1UL << RAMCFG_WPR4_P127WP_Pos)        /*!< 0x80000000 */
#define RAMCFG_WPR4_P127WP                  RAMCFG_WPR4_P127WP_Msk                   /*!< Write Protection Page 127 */


