zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e4xx.h
#define RCC_CCIPR5_DACSEL_Pos              (3UL)
#define RCC_CCIPR5_DACSEL_Msk              (0x1UL << RCC_CCIPR5_DACSEL_Pos)       /*!< 0x00000008 */
#define RCC_CCIPR5_DACSEL                  RCC_CCIPR5_DACSEL_Msk

#define RCC_CCIPR5_RNGSEL_Pos              (4UL)
#define RCC_CCIPR5_RNGSEL_Msk              (0x3UL << RCC_CCIPR5_RNGSEL_Pos)       /*!< 0x00000030 */
#define RCC_CCIPR5_RNGSEL                  RCC_CCIPR5_RNGSEL_Msk
#define RCC_CCIPR5_RNGSEL_0                (0x1UL << RCC_CCIPR5_RNGSEL_Pos)       /*!< 0x00000010 */
#define RCC_CCIPR5_RNGSEL_1                (0x2UL << RCC_CCIPR5_RNGSEL_Pos)       /*!< 0x00000020 */

#define RCC_CCIPR5_CECSEL_Pos              (6UL)
#define RCC_CCIPR5_CECSEL_Msk              (0x3UL << RCC_CCIPR5_CECSEL_Pos)       /*!< 0x000000C0 */
#define RCC_CCIPR5_CECSEL                  RCC_CCIPR5_CECSEL_Msk
#define RCC_CCIPR5_CECSEL_0                (0x1UL << RCC_CCIPR5_CECSEL_Pos)       /*!< 0x00000040 */
#define RCC_CCIPR5_CECSEL_1                (0x2UL << RCC_CCIPR5_CECSEL_Pos)       /*!< 0x00000080 */

#define RCC_CCIPR5_FDCANSEL_Pos            (8UL)
#define RCC_CCIPR5_FDCANSEL_Msk            (0x3UL << RCC_CCIPR5_FDCANSEL_Pos)     /*!< 0x00000300 */
#define RCC_CCIPR5_FDCANSEL                RCC_CCIPR5_FDCANSEL_Msk
#define RCC_CCIPR5_FDCANSEL_0              (0x1UL << RCC_CCIPR5_FDCANSEL_Pos)     /*!< 0x00000100 */
#define RCC_CCIPR5_FDCANSEL_1              (0x2UL << RCC_CCIPR5_FDCANSEL_Pos)     /*!< 0x00000200 */

#define RCC_CCIPR5_ETHPTPCLKSEL_Pos        (10UL)
#define RCC_CCIPR5_ETHPTPCLKSEL_Msk        (0x3UL << RCC_CCIPR5_ETHPTPCLKSEL_Pos) /*!< 0x00000C00 */
#define RCC_CCIPR5_ETHPTPCLKSEL            RCC_CCIPR5_ETHPTPCLKSEL_Msk
#define RCC_CCIPR5_ETHPTPCLKSEL_0          (0x1UL << RCC_CCIPR5_ETHPTPCLKSEL_Pos) /*!< 0x00000400 */
#define RCC_CCIPR5_ETHPTPCLKSEL_1          (0x2UL << RCC_CCIPR5_ETHPTPCLKSEL_Pos) /*!< 0x00000800 */
#define RCC_CCIPR5_OCTOSPI2SEL_Pos         (12UL)
#define RCC_CCIPR5_OCTOSPI2SEL_Msk         (0x3UL << RCC_CCIPR5_OCTOSPI2SEL_Pos)  /*!< 0x00003000 */
#define RCC_CCIPR5_OCTOSPI2SEL             RCC_CCIPR5_OCTOSPI2SEL_Msk
#define RCC_CCIPR5_OCTOSPI2SEL_0           (0x1UL << RCC_CCIPR5_OCTOSPI2SEL_Pos)  /*!< 0x00001000 */
#define RCC_CCIPR5_OCTOSPI2SEL_1           (0x2UL << RCC_CCIPR5_OCTOSPI2SEL_Pos)  /*!< 0x00002000 */
#define RCC_CCIPR5_SAI1SEL_Pos             (16UL)
#define RCC_CCIPR5_SAI1SEL_Msk             (0x7UL << RCC_CCIPR5_SAI1SEL_Pos)      /*!< 0x00070000 */
#define RCC_CCIPR5_SAI1SEL                 RCC_CCIPR5_SAI1SEL_Msk
#define RCC_CCIPR5_SAI1SEL_0               (0x1UL << RCC_CCIPR5_SAI1SEL_Pos)      /*!< 0x00010000 */
#define RCC_CCIPR5_SAI1SEL_1               (0x2UL << RCC_CCIPR5_SAI1SEL_Pos)      /*!< 0x00020000 */
#define RCC_CCIPR5_SAI1SEL_2               (0x4UL << RCC_CCIPR5_SAI1SEL_Pos)      /*!< 0x00040000 */

#define RCC_CCIPR5_SAI2SEL_Pos             (19UL)
#define RCC_CCIPR5_SAI2SEL_Msk             (0x7UL << RCC_CCIPR5_SAI2SEL_Pos)      /*!< 0x00380000 */
#define RCC_CCIPR5_SAI2SEL                 RCC_CCIPR5_SAI2SEL_Msk
#define RCC_CCIPR5_SAI2SEL_0               (0x1UL << RCC_CCIPR5_SAI2SEL_Pos)      /*!< 0x00080000 */
#define RCC_CCIPR5_SAI2SEL_1               (0x2UL << RCC_CCIPR5_SAI2SEL_Pos)      /*!< 0x00100000 */
#define RCC_CCIPR5_SAI2SEL_2               (0x4UL << RCC_CCIPR5_SAI2SEL_Pos)      /*!< 0x00200000 */

#define RCC_CCIPR5_LTDCSEL_Pos             (22UL)
#define RCC_CCIPR5_LTDCSEL_Msk             (0x1UL << RCC_CCIPR5_LTDCSEL_Pos)      /*!< 0x00400000 */
#define RCC_CCIPR5_LTDCSEL                 RCC_CCIPR5_LTDCSEL_Msk
#define RCC_CCIPR5_ETHREFCLKSEL_Pos        (23UL)
#define RCC_CCIPR5_ETHREFCLKSEL_Msk        (0x1UL << RCC_CCIPR5_ETHREFCLKSEL_Pos) /*!< 0x00800000 */
#define RCC_CCIPR5_ETHREFCLKSEL            RCC_CCIPR5_ETHREFCLKSEL_Msk
#define RCC_CCIPR5_ADF1SEL_Pos             (24UL)
#define RCC_CCIPR5_ADF1SEL_Msk             (0x7UL << RCC_CCIPR5_ADF1SEL_Pos)      /*!< 0x07000000 */
#define RCC_CCIPR5_ADF1SEL                 RCC_CCIPR5_ADF1SEL_Msk
#define RCC_CCIPR5_ADF1SEL_0               (0x1UL << RCC_CCIPR5_ADF1SEL_Pos)      /*!< 0x01000000 */
#define RCC_CCIPR5_ADF1SEL_1               (0x2UL << RCC_CCIPR5_ADF1SEL_Pos)      /*!< 0x02000000 */
#define RCC_CCIPR5_ADF1SEL_2               (0x4UL << RCC_CCIPR5_ADF1SEL_Pos)      /*!< 0x04000000 */
#define RCC_CCIPR5_MDF1SEL_Pos             (27UL)
#define RCC_CCIPR5_MDF1SEL_Msk             (0x7UL << RCC_CCIPR5_MDF1SEL_Pos)      /*!< 0x38000000 */
#define RCC_CCIPR5_MDF1SEL                 RCC_CCIPR5_MDF1SEL_Msk
#define RCC_CCIPR5_MDF1SEL_0               (0x1UL << RCC_CCIPR5_MDF1SEL_Pos)      /*!< 0x08000000 */
#define RCC_CCIPR5_MDF1SEL_1               (0x2UL << RCC_CCIPR5_MDF1SEL_Pos)      /*!< 0x20000000 */
#define RCC_CCIPR5_MDF1SEL_2               (0x4UL << RCC_CCIPR5_MDF1SEL_Pos)      /*!< 0x10000000 */
#define RCC_CCIPR5_CKERPSEL_Pos            (30UL)
#define RCC_CCIPR5_CKERPSEL_Msk            (0x3UL << RCC_CCIPR5_CKERPSEL_Pos)     /*!< 0xC0000000 */
#define RCC_CCIPR5_CKERPSEL                RCC_CCIPR5_CKERPSEL_Msk
#define RCC_CCIPR5_CKERPSEL_0              (0x1UL << RCC_CCIPR5_CKERPSEL_Pos)     /*!< 0x40000000 */
#define RCC_CCIPR5_CKERPSEL_1              (0x2UL << RCC_CCIPR5_CKERPSEL_Pos)     /*!< 0x80000000 */

/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos                  (0U)
#define RCC_BDCR_LSEON_Msk                  (0x1UL << RCC_BDCR_LSEON_Pos)           /*!< 0x00000001 */
#define RCC_BDCR_LSEON                      RCC_BDCR_LSEON_Msk
#define RCC_BDCR_LSERDY_Pos                 (1U)
#define RCC_BDCR_LSERDY_Msk                 (0x1UL << RCC_BDCR_LSERDY_Pos)          /*!< 0x00000002 */
#define RCC_BDCR_LSERDY                     RCC_BDCR_LSERDY_Msk
#define RCC_BDCR_LSEBYP_Pos                 (2U)
#define RCC_BDCR_LSEBYP_Msk                 (0x1UL << RCC_BDCR_LSEBYP_Pos)          /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP                     RCC_BDCR_LSEBYP_Msk
#define RCC_BDCR_LSEDRV_Pos                 (3U)
#define RCC_BDCR_LSEDRV_Msk                 (0x3UL << RCC_BDCR_LSEDRV_Pos)          /*!< 0x00000018 */
#define RCC_BDCR_LSEDRV                     RCC_BDCR_LSEDRV_Msk
#define RCC_BDCR_LSEDRV_0                   (0x1UL << RCC_BDCR_LSEDRV_Pos)          /*!< 0x00000008 */
#define RCC_BDCR_LSEDRV_1                   (0x2UL << RCC_BDCR_LSEDRV_Pos)          /*!< 0x00000010 */
#define RCC_BDCR_LSECSSON_Pos               (5U)
#define RCC_BDCR_LSECSSON_Msk               (0x1UL << RCC_BDCR_LSECSSON_Pos)        /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON                   RCC_BDCR_LSECSSON_Msk
#define RCC_BDCR_LSECSSD_Pos                (6U)
#define RCC_BDCR_LSECSSD_Msk                (0x1UL << RCC_BDCR_LSECSSD_Pos)         /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD                    RCC_BDCR_LSECSSD_Msk
#define RCC_BDCR_LSEEXT_Pos                 (7U)
#define RCC_BDCR_LSEEXT_Msk                 (0x1UL << RCC_BDCR_LSEEXT_Pos)          /*!< 0x00000080 */
#define RCC_BDCR_LSEEXT                     RCC_BDCR_LSEEXT_Msk
#define RCC_BDCR_RTCSEL_Pos                 (8U)
#define RCC_BDCR_RTCSEL_Msk                 (0x3UL << RCC_BDCR_RTCSEL_Pos)          /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL                     RCC_BDCR_RTCSEL_Msk
#define RCC_BDCR_RTCSEL_0                   (0x1UL << RCC_BDCR_RTCSEL_Pos)          /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1                   (0x2UL << RCC_BDCR_RTCSEL_Pos)          /*!< 0x00000200 */
#define RCC_BDCR_RTCEN_Pos                  (15U)
#define RCC_BDCR_RTCEN_Msk                  (0x1UL << RCC_BDCR_RTCEN_Pos)           /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                      RCC_BDCR_RTCEN_Msk
#define RCC_BDCR_VSWRST_Pos                 (16U)
#define RCC_BDCR_VSWRST_Msk                 (0x1UL << RCC_BDCR_VSWRST_Pos)          /*!< 0x00010000 */
#define RCC_BDCR_VSWRST                     RCC_BDCR_VSWRST_Msk
#define RCC_BDCR_LSCOEN_Pos                 (24U)
#define RCC_BDCR_LSCOEN_Msk                 (0x1UL << RCC_BDCR_LSCOEN_Pos)          /*!< 0x01000000 */
#define RCC_BDCR_LSCOEN                     RCC_BDCR_LSCOEN_Msk
#define RCC_BDCR_LSCOSEL_Pos                (25U)
#define RCC_BDCR_LSCOSEL_Msk                (0x1UL << RCC_BDCR_LSCOSEL_Pos)         /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                    RCC_BDCR_LSCOSEL_Msk
#define RCC_BDCR_LSION_Pos                  (26U)
#define RCC_BDCR_LSION_Msk                  (0x1UL << RCC_BDCR_LSION_Pos)           /*!< 0x04000000 */
#define RCC_BDCR_LSION                      RCC_BDCR_LSION_Msk
#define RCC_BDCR_LSIRDY_Pos                 (27U)
#define RCC_BDCR_LSIRDY_Msk                 (0x1UL << RCC_BDCR_LSIRDY_Pos)          /*!< 0x08000000 */
#define RCC_BDCR_LSIRDY                     RCC_BDCR_LSIRDY_Msk

